/** Видоизменение массива */
/* Заполнить элементы значениями */
var a1 = [1, 2, 3];
_.fill(a1, 'a');                            console.log(a1);  // => ['a', 'a', 'a']
var a2 = _.fill(Array(3), 2);               console.log(a2);  // => [2, 2, 2]
var a3 = _.fill([4, 6, 8, 10], '*', 1, 3);  console.log(a3);  // => [4, '*', '*', 10]
var a3 = _.fill([4, 6, 8, 10], '*', 1, 2);  console.log(a3);  // => [4, '*', 8, 10]

/* Реверс, развернуть все элементы задом напрерёд */
var array = [1, 2, 3];
_.reverse(array); console.log(array);// => [3, 2, 1]

/** Строка */
/*Преобразует все элементы массива в строку, разделенную разделителем.*/
var a = _.join(['a', 'b', 'c'], '~');// => 'a~b~c'